{
  "card_fav_stack": "Favorite Stack",
  "card_experience": "Javascript | Typescript | NodeJs - NestJs, ExpressJs | ReactJs - NextJs, Remix, Vite | React-Native - Expo | AWS",
  "card_current_job": "Current",
  "card_job_title": "Sr Front-End",
  "card_degree_title": "Computer Science",
  "card_skills": "skills",
  "card_years": "years",
  "card_location": "Brazil",
  "card_introduce": "Turning complex problems into",
  "card_introduce2": "clean, scalable web solutions",
  "card_short_description": "Specialist in web applications with React, NodeJs and AWS.",
  "card_short_description2": "I specialize in creating intuitive, scalable user interfaces and have strong experience with: ",
  "card_short_skills": "Javascript, Typescript, NodeJs, React, React-Native and AWS",
  "about_me": {
    "description_1": "Full-Stack Engineer with over 12 years of experience building and evolving digital products in diverse environments. I’m motivated by complex challenges and focused on delivering solutions that generate real value for users and businesses.",
    "description_2": "Throughout my career, I’ve worked with both lean teams and large, distributed organizations. Currently, I work in the e-commerce domain, contributing to high-traffic platforms and collaborating across web and mobile teams to deliver consistent and high-quality user experiences.",
    "description_3": "I strongly believe in building performant, reliable, and scalable solutions that support real-time user needs. My background has prepared me to handle challenges related to growth, optimization, and continuous delivery, always with a focus on efficiency, quality, and long-term sustainability."
  },
  "footer": {
    "keep_in_touch": "Let's keep in touch",
    "social_midia_call_to_action": "my social profiles"
  },
  "experience": {
    "trafilea": {
      "company": "Trafilea, America Latina",
      "position": "Engenheiro Front-End Sr",
      "period": "Fev 2024 - Current",
      "description": "At Trafilea Tech E-commerce Group, I collaborate with Product Owners to develop sales-driven features using React and Next.js. I architect and deliver new features on a weekly basis, focusing on scalability, performance, and customer experience."
    },
    "addi": {
      "company": "Addi, Latin America",
      "position": "SR Front-End Engineer",
      "period": "May 2022 - November 2023",
      "description": "At Addi, I contributed to a BNPL (Buy Now, Pay Later) payment platform operating in Colombia and Brazil. I worked across web and mobile platforms using React and React Native, collaborating with an international team in an English-speaking environment. This role allowed me to leverage the full React stack to deliver scalable and seamless user experiences."
    },
    "olist": {
      "company": "Olist, Brazil",
      "position": "SR Front-End Engineer",
      "period": "From Jun 2021 - May 2022",
      "description": "Olist is a platform (B2B) that helps sellers to sell their products on Mercado Livre and other Markets Places such as Americanas. Olist is a big store inside these market-places and has a huge platform to help the sellers join (and sell products) with a more evaluated profile. On Olist I worked on the Growth team implementing some functionalities to improve the user experience. Our goal was to create a simple and usable platform to let the non-technical user have a good understanding of what is Olist and what Olist does."
    },
    "tarkuss": {
      "company": "Tarkus, Brazil",
      "position": "SR Front-End Engineer and Tech Lead",
      "period": "May 2019 - May 2021",
      "description": "At Tarkus, I stepped into my first major Tech Lead role, where I led the formation and growth of engineering teams. I was responsible for hiring engineers, defining technical stacks, and leading the development of new projects. I played a key role in architecting and delivering a Cashback platform, including the development of all supporting APIs for both web and mobile applications. The solution served B2B and B2C users, with a focus on enhancing the in-store shopping experience through personalized recommendations based on purchase history and cashback rewards."
    },
    "itriad": {
      "company": "Itriad Institute, Brazil",
      "position": "SR Front-End Engineer",
      "period": "Oct 2016 - Apr 2019",
      "description": "Working close to Kaios global team. This was the first time I'd worked with a foreign team using English as one of the languages to communicate (part of the team was based in China). Kaios is an operational system built for smart feature phones. In Itriad I had the opportunity to use React in a large-scale project for the first time. I helped my teams to create Two Maps apps (POI-based), an activity recorder app, a play music app, and a To-Do List app. At this company, I had my first experience with leading a team (small team)."
    },
    "axm": {
      "company": "AXM Institute, Brazil",
      "position": "Full-Stack Engineer",
      "period": "October 2015 -  September 2016.",
      "description": "Development of the payment system - gateway, reconciliation, and Back-Office - as well as the implementation of the API for notification of transactions made via POS for clients with their own Platform. Development of an API to help the Web Client in the POS requests, CMS for Whirlpool inventory control, and sales reconciliation API and client app. "
    },
    "novaera": {
      "company": "Mercantil Nova Era, Brazil",
      "position": "Full-Stack Engineer",
      "period": "September 2014 - June 2015.",
      "description": "Development of internal systems by working together with the company's ERP team. Participation in the creation of a system for reconciling purchases made with cards on POS terminals. Creation of two modules for querying sales made in the wholesale company and a module that serves the same need for Cash & Carry companies. Inventory system - inventories for the logistics part of the company. Price Search System, an Android app with PHP REST API."
    },
    "adptdata": {
      "company": "Adapt Data, Brazil",
      "position": "Full-Stack Engineer",
      "period": "November 2013 - May 2014.",
      "description": "Participation in the development of systems - Pubs & Restaurants (PDV), Despachantes Manaus (Service order control) - both internal systems."
    }
  },
  "home": {
    "experience": "job experience",
    "skills": "tech skills",
    "about_me": "about me"
  }
}
